DoneTech-IoT/IoTPlatform/sdkconfig.defaults
#
# LVGL TFT Display controller
#
CONFIG_LV_PREDEFINED_DISPLAY_NONE=y
# CONFIG_LV_PREDEFINED_DISPLAY_WROVER4 is not set
# CONFIG_LV_PREDEFINED_DISPLAY_M5STACK is not set
# CONFIG_LV_PREDEFINED_DISPLAY_M5CORE2 is not set
# CONFIG_LV_PREDEFINED_DISPLAY_M5STICK is not set
# CONFIG_LV_PREDEFINED_DISPLAY_M5STICKC is not set
# CONFIG_LV_PREDEFINED_DISPLAY_ERTFT0356 is not set
# CONFIG_LV_PREDEFINED_DISPLAY_ADA_FEATHERWING is not set
# CONFIG_LV_PREDEFINED_DISPLAY_RPI_MPI3501 is not set
# CONFIG_LV_PREDEFINED_DISPLAY_WEMOS_LOLIN is not set
# CONFIG_LV_PREDEFINED_DISPLAY_ATAG is not set
# CONFIG_LV_PREDEFINED_DISPLAY_RPI_RA8875 is not set
# CONFIG_LV_PREDEFINED_DISPLAY_TTGO is not set
# CONFIG_LV_PREDEFINED_DISPLAY_TTGO_CAMERA_PLUS is not set
# CONFIG_LV_PREDEFINED_DISPLAY_WT32_SC01 is not set
CONFIG_LV_TFT_DISPLAY_CONTROLLER_RM67162=y
CONFIG_LV_TFT_DISPLAY_PROTOCOL_SPI=y
# CONFIG_LV_DISPLAY_ORIENTATION_PORTRAIT is not set
# CONFIG_LV_DISPLAY_ORIENTATION_PORTRAIT_INVERTED is not set
CONFIG_LV_DISPLAY_ORIENTATION_LANDSCAPE=y
# CONFIG_LV_DISPLAY_ORIENTATION_LANDSCAPE_INVERTED is not set
CONFIG_LV_DISPLAY_ORIENTATION=2
CONFIG_LV_PREDEFINED_PINS_NONE=y
# CONFIG_LV_PREDEFINED_PINS_38V4 is not set
# CONFIG_LV_PREDEFINED_PINS_30 is not set
# CONFIG_LV_PREDEFINED_PINS_38V1 is not set
# CONFIG_LV_PREDEFINED_PINS_TKOALA is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ILI9341 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ILI9481 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ILI9486 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ILI9488 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ST7789 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ST7796S is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_GC9A01 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ST7735S is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_HX8357 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_SH1107 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_SSD1306 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_FT81X is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_IL3820 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_JD79653A is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_UC8151D is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_RA8875 is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_ILI9163C is not set
# CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_PCD8544 is not set
CONFIG_LV_TFT_DISPLAY_USER_CONTROLLER_RM67162=y
# CONFIG_CUSTOM_DISPLAY_BUFFER_SIZE is not set
# CONFIG_LV_TFT_DISPLAY_SPI2_HOST is not set
CONFIG_LV_TFT_DISPLAY_SPI3_HOST=y
# CONFIG_LV_TFT_DISPLAY_SPI_TRANS_MODE_SIO is not set
# CONFIG_LV_TFT_DISPLAY_SPI_TRANS_MODE_DIO is not set
CONFIG_LV_TFT_DISPLAY_SPI_TRANS_MODE_QIO=y
CONFIG_LV_TFT_DISPLAY_SPI_HALF_DUPLEX=y
CONFIG_LV_TFT_USE_CUSTOM_SPI_CLK_DIVIDER=y
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_1 is not set
CONFIG_LV_TFT_SPI_CLK_DIVIDER_2=y
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_3 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_4 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_5 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_6 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_7 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_8 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_9 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_10 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_12 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_16 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_20 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_24 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_32 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_40 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_48 is not set
# CONFIG_LV_TFT_SPI_CLK_DIVIDER_80 is not set
CONFIG_LV_TFT_CUSTOM_SPI_CLK_DIVIDER=2

#
# Display Pin Assignments
#
CONFIG_LV_DISP_SPI_MOSI=18
CONFIG_LV_DISPLAY_USE_SPI_MISO=y
CONFIG_LV_DISP_SPI_MISO=7
CONFIG_LV_DISP_SPI_INPUT_DELAY_NS=0
CONFIG_LV_DISP_SPI_IO2=48
CONFIG_LV_DISP_SPI_IO3=5
CONFIG_LV_DISP_SPI_CLK=47
# CONFIG_LV_DISPLAY_USE_SPI_CS is not set
# CONFIG_LV_DISPLAY_USE_DC is not set
CONFIG_LV_DISP_USE_RST=y
CONFIG_LV_DISP_PIN_RST=17
# end of Display Pin Assignments

CONFIG_LV_DISP_BACKLIGHT_OFF=y
# CONFIG_LV_DISP_BACKLIGHT_SWITCH is not set
# CONFIG_LV_DISP_BACKLIGHT_PWM is not set
CONFIG_LV_I2C_DISPLAY_PORT=0
# end of LVGL TFT Display controller

#
# LVGL Touch controller
#
CONFIG_LV_TOUCH_CONTROLLER=0
CONFIG_LV_TOUCH_CONTROLLER_NONE=y
# CONFIG_LV_TOUCH_CONTROLLER_XPT2046 is not set
# CONFIG_LV_TOUCH_CONTROLLER_FT6X06 is not set
# CONFIG_LV_TOUCH_CONTROLLER_STMPE610 is not set
# CONFIG_LV_TOUCH_CONTROLLER_ADCRAW is not set
# CONFIG_LV_TOUCH_CONTROLLER_FT81X is not set
# CONFIG_LV_TOUCH_CONTROLLER_RA8875 is not set
# CONFIG_LV_TOUCH_CONTROLLER_GT911 is not set
CONFIG_LV_I2C_TOUCH_PORT=0
# end of LVGL Touch controller
# end of LVGL ESP Drivers

#
# jsmn
#
# CONFIG_JSMN_PARENT_LINKS is not set
# CONFIG_JSMN_STRICT is not set
# CONFIG_JSMN_STATIC is not set
# end of jsmn

#
# Diagnostics
#
CONFIG_DIAG_LOG_MSG_ARG_FORMAT_TLV=y
# CONFIG_DIAG_LOG_MSG_ARG_FORMAT_STRING is not set
CONFIG_DIAG_LOG_MSG_ARG_MAX_SIZE=64
CONFIG_DIAG_LOG_DROP_WIFI_LOGS=y
CONFIG_DIAG_ENABLE_METRICS=y
CONFIG_DIAG_METRICS_MAX_COUNT=20
CONFIG_DIAG_ENABLE_HEAP_METRICS=y
CONFIG_DIAG_ENABLE_WIFI_METRICS=y
CONFIG_DIAG_ENABLE_VARIABLES=y
CONFIG_DIAG_VARIABLES_MAX_COUNT=20
CONFIG_DIAG_ENABLE_NETWORK_VARIABLES=y
# CONFIG_DIAG_MORE_NETWORK_VARS is not set
# CONFIG_DIAG_USE_EXTERNAL_LOG_WRAP is not set
# end of Diagnostics

#
# mDNS
#
CONFIG_MDNS_MAX_INTERFACES=3
CONFIG_MDNS_MAX_SERVICES=10
CONFIG_MDNS_TASK_PRIORITY=1
CONFIG_MDNS_ACTION_QUEUE_LEN=16
CONFIG_MDNS_TASK_STACK_SIZE=4096
# CONFIG_MDNS_TASK_AFFINITY_NO_AFFINITY is not set
CONFIG_MDNS_TASK_AFFINITY_CPU0=y
# CONFIG_MDNS_TASK_AFFINITY_CPU1 is not set
CONFIG_MDNS_TASK_AFFINITY=0x0
CONFIG_MDNS_SERVICE_ADD_TIMEOUT_MS=2000
CONFIG_MDNS_TIMER_PERIOD_MS=100
# CONFIG_MDNS_NETWORKING_SOCKET is not set
# CONFIG_MDNS_SKIP_SUPPRESSING_OWN_QUERIES is not set
# CONFIG_MDNS_ENABLE_DEBUG_PRINTS is not set
CONFIG_MDNS_ENABLE_CONSOLE_CLI=y
# CONFIG_MDNS_RESPOND_REVERSE_QUERIES is not set
CONFIG_MDNS_MULTIPLE_INSTANCE=y

#
# MDNS Predefined interfaces
#
CONFIG_MDNS_PREDEF_NETIF_STA=y
CONFIG_MDNS_PREDEF_NETIF_AP=y
CONFIG_MDNS_PREDEF_NETIF_ETH=y
# end of MDNS Predefined interfaces
# end of mDNS

#
# ESP Secure Cert Manager
#
# CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL is not set
# CONFIG_ESP_SECURE_CERT_SUPPORT_LEGACY_FORMATS is not set
# end of ESP Secure Cert Manager

#
# ESP Insights
#
# CONFIG_ESP_INSIGHTS_ENABLED is not set
# CONFIG_ESP_INSIGHTS_TRANSPORT_MQTT is not set
CONFIG_ESP_INSIGHTS_TRANSPORT_HTTPS=y
CONFIG_ESP_INSIGHTS_TRANSPORT_HTTPS_HOST="https://client.insights.espressif.com"
CONFIG_ESP_INSIGHTS_CLOUD_POST_MIN_INTERVAL_SEC=60
CONFIG_ESP_INSIGHTS_CLOUD_POST_MAX_INTERVAL_SEC=240
# end of ESP Insights

#
# IoT Button
#
CONFIG_BUTTON_PERIOD_TIME_MS=20
CONFIG_BUTTON_DEBOUNCE_TICKS=2
CONFIG_BUTTON_SHORT_PRESS_TIME_MS=180
CONFIG_BUTTON_LONG_PRESS_TIME_MS=5000

# disable softap by default
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Disable DS Peripheral
CONFIG_ESP_SECURE_CERT_DS_PERIPHERAL=n

# Use compact attribute storage mode
CONFIG_ESP_MATTER_NVS_USE_COMPACT_ATTR_STORAGE=y

# Enable HKDF in mbedtls
CONFIG_MBEDTLS_HKDF_C=y

# Increase LwIP IPv6 address number to 6 (MAX_FABRIC + 1)
# unique local addresses for fabrics(MAX_FABRIC), a link local address(1)
CONFIG_LWIP_IPV6_NUM_ADDRESSES=6